{"pageProps":{"workSource":{"compiledSource":"\"use strict\";\n\nfunction _extends() { _extends = Object.assign || function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\n\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\n/* @jsxRuntime classic */\n\n/* @jsx mdx */\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\n\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n      props = _objectWithoutProperties(_ref, [\"components\"]);\n\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"h2\", null, \"Notre client\"), mdx(\"p\", null, \"Le groupe BPCE est le deuxi\\xE8me groupe bancaire en France, n\\xE9 en 2009 de la fusion de l\\u2019organe central du r\\xE9seau des Caisses d\\u2019\\xC9pargne et de celui des Banques Populaires. Comme les autres acteurs du secteur bancaire, BPCE est actuellement en pleine transition digitale.\"), mdx(\"h2\", null, \"La mission qui nous a \\xE9t\\xE9 confi\\xE9e\"), mdx(\"p\", null, \"Aider une Caisse d\\u2019Epargne r\\xE9gionale \\xE0 repenser le quotidien des collaborateurs gr\\xE2ce au digital, et \\xE0 mieux tirer profit des donn\\xE9es internes.\"), mdx(\"p\", null, \"Dans ce cadre nous avons \\xE9t\\xE9 amen\\xE9s \\xE0 nous int\\xE9resser au reengineering et \\xE0 la d\\xE9mat\\xE9rialisation des processus du p\\xF4le Ressources Humaines. Ces processus avaient pour particularit\\xE9 d\\u2019\\xEAtre \\u201Cl\\xE9gers\\u201D, c\\u2019est-\\xE0-dire qu\\u2019ils ne m\\xE9ritaient pas, pour des raisons de co\\xFBt, qu\\u2019on leur adresse des ressources sp\\xE9cifiques. D\\u2019un autre c\\xF4t\\xE9, leur cumul les rendait temporellement lourds et peu cr\\xE9ateurs de valeur ajout\\xE9e ; ils ne pouvaient donc pas rester en l\\u2019\\xE9tat.\"), mdx(\"h2\", null, \"Enjeux\"), mdx(\"p\", null, \"Contrainte de ressources : re-concevoir les processus RH avec des moyens humains et mat\\xE9riels ultra-limit\\xE9s, en un temps minimum.\"), mdx(\"p\", null, \"Mont\\xE9e en comp\\xE9tences des collaborateurs sur les technologies web r\\xE9centes : n\\xE9cessit\\xE9 de familiariser l\\u2019\\xE9quipe interne de d\\xE9veloppeurs avec des technologies de d\\xE9veloppement rapide et avec les m\\xE9thodes de gestion de projet utilis\\xE9es par les startups.\"), mdx(\"h2\", null, \"Notre intervention\"), mdx(\"h3\", null, \"Phase 1 : Audit et \\xE9tude de terrain\"), mdx(\"p\", null, \"Nous avons r\\xE9alis\\xE9 des entretiens avec les diff\\xE9rents collaborateurs-acteurs du processus, au sein des diff\\xE9rents p\\xF4les intervenant dans les processus. Cela nous a permis d\\u2019identifier les actions r\\xE9alis\\xE9es par chaque acteur, de prendre en compte les contraintes auxquelles chacun est soumis, de r\\xE9aliser les mesures et de recueillir les informations indispensables \\xE0 l\\u2019analyse du processus et de ses performances.\"), mdx(\"h3\", null, \"Phase 2 : Analyse\"), mdx(\"p\", null, \"Gr\\xE2ce aux informations r\\xE9colt\\xE9es, nous avons pu cartographier le processus, et identifier les activit\\xE9s \\xE0 fortes valeurs ajout\\xE9es, les temps morts et les gaspillages.\"), mdx(\"h3\", null, \"Phase 3 : Reengineering du processus\"), mdx(\"p\", null, \"Nous avons repens\\xE9 et red\\xE9fini les processus RH. Cette demarche s\\u2019inscrivant dans le plan de transition digitale de la Caisse d\\u2019Epargne, nous nous sommes appuy\\xE9s sur les atouts du digital pour reconcevoir ces processus sous contraintes de co\\xFBt et de temps.\"), mdx(\"p\", null, \"Nous avons alors propos\\xE9 le d\\xE9veloppement d\\u2019une application RH, plate-forme qui centraliserait toutes les op\\xE9rations et qui permettrait de simplifier la gestion des activit\\xE9s, donc de limiter les temps morts et inefficacit\\xE9s.\"), mdx(\"p\", null, \"Pour d\\xE9velopper cette application avec des moyens humains et mat\\xE9riels ultra-limit\\xE9s, nous avons opt\\xE9 pour les technologies innovantes utilis\\xE9es par les startups. Cette solution impliquait cependant la diversification des comp\\xE9tences de l\\u2019\\xE9quipe de d\\xE9veloppeurs de la Caisse d\\u2019Epargne, ce qui induisait des co\\xFBts li\\xE9s au changement de routines et li\\xE9s \\xE0 l\\u2019apprentissage de la technologie elle-m\\xEAme.\"), mdx(\"h3\", null, \"Phase 4 : Pair programming et mont\\xE9e en comp\\xE9tences de l\\u2019\\xE9quipe de d\\xE9veloppeurs\"), mdx(\"p\", null, \"Nous avons orient\\xE9 les choix technologiques de l\\u2019\\xE9quipe vers des solutions qui ont prouv\\xE9 leur efficacit\\xE9 aussi bien chez les startups que chez certains g\\xE9ants du web : Vue.js pour l\\u2019interface graphique, et Lumen (framework l\\xE9ger d\\xE9riv\\xE9 de Laravel) pour la couche m\\xE9tier c\\xF4t\\xE9 serveur.\"), mdx(\"p\", null, \"Pour faciliter le d\\xE9marrage du projet, nous avons partag\\xE9 notre expertise en fournissant une premi\\xE8re base de code, comprenant la structure globale de l\\u2019application ainsi que des modules complexes servant d\\u2019exemples.\"), mdx(\"p\", null, \"Bien entendu, fournir du code ne suffit pas ; ce sont les \\xE9changes r\\xE9guliers r\\xE9alis\\xE9s avec les d\\xE9veloppeurs de l\\u2019\\xE9quipe qui ont permis le transfert de connaissances, la base de code servant de support concret \\xE0 l\\u2019\\xE9change et servant d\\u2019exemple d\\u2019application.\"), mdx(\"h2\", null, \"R\\xE9sultats\"), mdx(\"p\", null, \"En un mois, la majorit\\xE9 des fonctionnalit\\xE9s \\xE9tait en place, et une premi\\xE8re version de l\\u2019application est en cours de finalisation.\"), mdx(\"p\", null, mdx(\"img\", {\n    parentName: \"p\",\n    \"src\": \"/works/caisse-epargne/note_frais_compressed.png\",\n    \"alt\": \"Plateforme RH Caisse d'Epargne\"\n  })), mdx(\"p\", null, mdx(\"em\", {\n    parentName: \"p\"\n  }, \"Aper\\xE7u de l\\u2019interface de d\\xE9claration et d\\u2019administration des notes de frais con\\xE7ue et d\\xE9velopp\\xE9e en collaboration avec l\\u2019\\xE9quipe de d\\xE9veloppeurs de la Caisse d\\u2019Epargne r\\xE9gionale au sein de laquelle nous sommes intervenus.\")));\n}\n\n;\nMDXContent.isMDXComponent = true;","renderedOutput":"<h2 class=\"text-4xl font-extralight my-6 text-text-heavy\">Notre client</h2><p class=\"text-justify\">Le groupe BPCE est le deuxième groupe bancaire en France, né en 2009 de la fusion de l’organe central du réseau des Caisses d’Épargne et de celui des Banques Populaires. Comme les autres acteurs du secteur bancaire, BPCE est actuellement en pleine transition digitale.</p><h2 class=\"text-4xl font-extralight my-6 text-text-heavy\">La mission qui nous a été confiée</h2><p class=\"text-justify\">Aider une Caisse d’Epargne régionale à repenser le quotidien des collaborateurs grâce au digital, et à mieux tirer profit des données internes.</p><p class=\"text-justify\">Dans ce cadre nous avons été amenés à nous intéresser au reengineering et à la dématérialisation des processus du pôle Ressources Humaines. Ces processus avaient pour particularité d’être “légers”, c’est-à-dire qu’ils ne méritaient pas, pour des raisons de coût, qu’on leur adresse des ressources spécifiques. D’un autre côté, leur cumul les rendait temporellement lourds et peu créateurs de valeur ajoutée ; ils ne pouvaient donc pas rester en l’état.</p><h2 class=\"text-4xl font-extralight my-6 text-text-heavy\">Enjeux</h2><p class=\"text-justify\">Contrainte de ressources : re-concevoir les processus RH avec des moyens humains et matériels ultra-limités, en un temps minimum.</p><p class=\"text-justify\">Montée en compétences des collaborateurs sur les technologies web récentes : nécessité de familiariser l’équipe interne de développeurs avec des technologies de développement rapide et avec les méthodes de gestion de projet utilisées par les startups.</p><h2 class=\"text-4xl font-extralight my-6 text-text-heavy\">Notre intervention</h2><style data-emotion=\"css 182fx18\">.css-182fx18{padding-left:64px;}@media screen and (max-width: 1280px){.css-182fx18{padding-left:8px;}}</style><h3 class=\"css-182fx18\">Phase 1 : Audit et étude de terrain</h3><p class=\"text-justify\">Nous avons réalisé des entretiens avec les différents collaborateurs-acteurs du processus, au sein des différents pôles intervenant dans les processus. Cela nous a permis d’identifier les actions réalisées par chaque acteur, de prendre en compte les contraintes auxquelles chacun est soumis, de réaliser les mesures et de recueillir les informations indispensables à l’analyse du processus et de ses performances.</p><style data-emotion=\"css 182fx18\">.css-182fx18{padding-left:64px;}@media screen and (max-width: 1280px){.css-182fx18{padding-left:8px;}}</style><h3 class=\"css-182fx18\">Phase 2 : Analyse</h3><p class=\"text-justify\">Grâce aux informations récoltées, nous avons pu cartographier le processus, et identifier les activités à fortes valeurs ajoutées, les temps morts et les gaspillages.</p><style data-emotion=\"css 182fx18\">.css-182fx18{padding-left:64px;}@media screen and (max-width: 1280px){.css-182fx18{padding-left:8px;}}</style><h3 class=\"css-182fx18\">Phase 3 : Reengineering du processus</h3><p class=\"text-justify\">Nous avons repensé et redéfini les processus RH. Cette demarche s’inscrivant dans le plan de transition digitale de la Caisse d’Epargne, nous nous sommes appuyés sur les atouts du digital pour reconcevoir ces processus sous contraintes de coût et de temps.</p><p class=\"text-justify\">Nous avons alors proposé le développement d’une application RH, plate-forme qui centraliserait toutes les opérations et qui permettrait de simplifier la gestion des activités, donc de limiter les temps morts et inefficacités.</p><p class=\"text-justify\">Pour développer cette application avec des moyens humains et matériels ultra-limités, nous avons opté pour les technologies innovantes utilisées par les startups. Cette solution impliquait cependant la diversification des compétences de l’équipe de développeurs de la Caisse d’Epargne, ce qui induisait des coûts liés au changement de routines et liés à l’apprentissage de la technologie elle-même.</p><style data-emotion=\"css 182fx18\">.css-182fx18{padding-left:64px;}@media screen and (max-width: 1280px){.css-182fx18{padding-left:8px;}}</style><h3 class=\"css-182fx18\">Phase 4 : Pair programming et montée en compétences de l’équipe de développeurs</h3><p class=\"text-justify\">Nous avons orienté les choix technologiques de l’équipe vers des solutions qui ont prouvé leur efficacité aussi bien chez les startups que chez certains géants du web : Vue.js pour l’interface graphique, et Lumen (framework léger dérivé de Laravel) pour la couche métier côté serveur.</p><p class=\"text-justify\">Pour faciliter le démarrage du projet, nous avons partagé notre expertise en fournissant une première base de code, comprenant la structure globale de l’application ainsi que des modules complexes servant d’exemples.</p><p class=\"text-justify\">Bien entendu, fournir du code ne suffit pas ; ce sont les échanges réguliers réalisés avec les développeurs de l’équipe qui ont permis le transfert de connaissances, la base de code servant de support concret à l’échange et servant d’exemple d’application.</p><h2 class=\"text-4xl font-extralight my-6 text-text-heavy\">Résultats</h2><p class=\"text-justify\">En un mois, la majorité des fonctionnalités était en place, et une première version de l’application est en cours de finalisation.</p><p class=\"text-justify\"><style data-emotion=\"css r2bpky\">.css-r2bpky{display:block;max-height:400px;max-width:90%;margin-left:auto;margin-right:auto;}</style><img src=\"/works/caisse-epargne/note_frais_compressed.png\" alt=\"Plateforme RH Caisse d&#x27;Epargne\" class=\"css-r2bpky\"/></p><p class=\"text-justify\"><em>Aperçu de l’interface de déclaration et d’administration des notes de frais conçue et développée en collaboration avec l’équipe de développeurs de la Caisse d’Epargne régionale au sein de laquelle nous sommes intervenus.</em></p>","scope":{}},"workMeta":{"data":{"title":"Optimiser les processus RH à la Caisse d'Epargne","slug":"processus-rh-caisse-epargne","banner":"/works/caisse-epargne/banner.png","thumbnail":"/works/caisse-epargne/thumbnail.png","summary":"Le groupe BPCE est le deuxième groupe bancaire en France, né en 2009 de la fusion de l’organe central du réseau des Caisses d’Épargne et de celui des Banques Populaires. Comme les autres acteurs du secteur bancaire, BPCE est actuellement en pleine transition digitale."},"filename":"caisse-epargne.md"}},"__N_SSG":true}