{"pageProps":{"worksMeta":[{"title":"Développer une application de cartographie de données pour la RGPD","slug":"cartographie-rgpd","summary":"Actinuance est un cabinet de conseil spécialisé en gestion des risques et sécurité des systèmes d’information. L’entreprise accompagne notamment ses clients dans leur mise en conformité avec la Réglementation sur la Protection des Données Personnelles (RGPD) et la gestion des données sur le long terme.","banner":"/works/actinuance/banner.png","thumbnail":"/works/actinuance/thumbnail.jpg"},{"title":"Optimiser les processus RH à la Caisse d'Epargne","slug":"processus-rh-caisse-epargne","banner":"/works/caisse-epargne/banner.png","thumbnail":"/works/caisse-epargne/thumbnail.png","summary":"Le groupe BPCE est le deuxième groupe bancaire en France, né en 2009 de la fusion de l’organe central du réseau des Caisses d’Épargne et de celui des Banques Populaires. Comme les autres acteurs du secteur bancaire, BPCE est actuellement en pleine transition digitale."},{"title":"Gérer une flotte de runners en temps réel","slug":"real-time-runners","summary":"Simply Charge est une startup qui fournit des batteries mobiles à usage unique. Ces batteries sont mises à disposition dans des distributeurs automatiques, installés chez des commerçants ou dans des lieux publics. Concept prometteur car à la fois pratique pour les personnes tombées en panne de batterie à l’ère des smartphones ultrapuissants, et pour les commerçants qui y voient une source de revenu et de publicité.","banner":"/works/simply-charge/banner.png","thumbnail":"/works/simply-charge/thumbnail.png"},{"title":"Etude go/no go pour le projet Voice Less","slug":"go-nogo-report-voiceless","summary":"Suite à plusieurs séances de travail dans des espaces de coworking, Guillaume s’est posé la question suivante : parler sans être entendu, est-ce possible ? Est donc née l’idée de Voice Less, un device apportant une isolation sonore ultra-localisée.","banner":"/works/voiceless/banner.jpeg","thumbnail":"/works/voiceless/thumbnail.jpeg"}]},"__N_SSG":true}