{"template":"../src/containers/Work.jsx","sharedHashesByProp":{},"data":{"work":{"attributes":{"title":"Etude go/no go pour le projet Voice Less","slug":"go-nogo-report-voiceless","summary":"Suite à plusieurs séances de travail dans des espaces de coworking, Guillaume s’est posé la question suivante : parler sans être entendu, est-ce possible ? Est donc née l’idée de Voice Less, un device apportant une isolation sonore ultra-localisée.","banner":"/works/voiceless/banner.jpeg","thumbnail":"/works/voiceless/thumbnail.jpeg"},"body":"## Notre client\n\nGuillaume Debreu est le fondateur de la société Guimzu, société éditrice de sites internet. Suite à plusieurs séances de travail dans des espaces de coworking, Guillaume s’est posé la question suivante : parler sans être entendu, est-ce possible ? Est donc née l’idée de Voice Less, un device apportant une isolation sonore ultra-localisée.\n\n## La mission qui nous a été confiée\n\nRéaliser une étude de faisabilité technique et formuler des préconisations pour le développement du projet.\n\nAvant de lancer son projet entrepreneurial, Guillaume Debreu a souhaité vérifier la faisabilité technique de son projet à la lumière de l’état de l’art le plus récent. Il désirait également avoir un aperçu du marché et de la concurrence. Avec ces éléments, le porteur de projet aspirait à ce que nous mettions en évidence des voies de développement possibles, et que nous le conseillions dans la suite à donner en termes de démarches entrepreneuriales.\n\n## Notre intervention\n\n### Phase 1 : Réalisation de l’état de l’art et de l’état du marché\n\n- Etude des articles de recherche sur la thématique de l’annulation des sons dans des revues académiques et professionnelles\n- Analyse des brevets déposés\n- Analyse de la concurrence et panorama des solutions existantes sur le marché\n\n### Phase 2 : Diagnostic et proposition de voies de développement\n\nProposition de voies de développement sur les plans technique (devices, choix de filtres, etc.) et commercial (cible, distribution, etc.).\n\n## Résultats\n\nEn 4 jours, nous avons pu réaliser un état de l’art technologique et une analyse de marché qui nous ont permis de présenter au porteur de projet les voies de développement pour son idée. Cela lui a donné toutes les informations nécessaires au lancement d’un projet fortement innovant.\n\nGuillaume Debreu est ensuite entré en toute sérénité dans la phase de prototypage, accompagné par une société d’ingénierie spécialisée dans l’acoustique.\n","frontmatter":"title: Etude go/no go pour le projet Voice Less\nslug: go-nogo-report-voiceless\nsummary: \"Suite à plusieurs séances de travail dans des espaces de coworking, Guillaume s’est posé la question suivante : parler sans être entendu, est-ce possible ? Est donc née l’idée de Voice Less, un device apportant une isolation sonore ultra-localisée.\"\nbanner: /works/voiceless/banner.jpeg\nthumbnail: /works/voiceless/thumbnail.jpeg"}},"path":"works/go-nogo-report-voiceless"}
