{"template":"../src/containers/Work.jsx","sharedHashesByProp":{},"data":{"work":{"attributes":{"title":"Optimiser les processus RH à la Caisse d'Epargne","slug":"processus-rh-caisse-epargne","banner":"/works/caisse-epargne/banner.png","thumbnail":"/works/caisse-epargne/thumbnail.png","summary":"Le groupe BPCE est le deuxième groupe bancaire en France, né en 2009 de la fusion de l’organe central du réseau des Caisses d’Épargne et de celui des Banques Populaires. Comme les autres acteurs du secteur bancaire, BPCE est actuellement en pleine transition digitale."},"body":"## Notre client\n\nLe groupe BPCE est le deuxième groupe bancaire en France, né en 2009 de la fusion de l’organe central du réseau des Caisses d’Épargne et de celui des Banques Populaires. Comme les autres acteurs du secteur bancaire, BPCE est actuellement en pleine transition digitale.\n\n## La mission qui nous a été confiée\n\nAider une Caisse d’Epargne régionale à repenser le quotidien des collaborateurs grâce au digital, et à mieux tirer profit des données internes.\n\nDans ce cadre nous avons été amenés à nous intéresser au reengineering et à la dématérialisation des processus du pôle Ressources Humaines. Ces processus avaient pour particularité d’être “légers”, c’est-à-dire qu’ils ne méritaient pas, pour des raisons de coût, qu’on leur adresse des ressources spécifiques. D’un autre côté, leur cumul les rendait temporellement lourds et peu créateurs de valeur ajoutée ; ils ne pouvaient donc pas rester en l’état.\n\n## Enjeux\n\nContrainte de ressources : re-concevoir les processus RH avec des moyens humains et matériels ultra-limités, en un temps minimum.\n\nMontée en compétences des collaborateurs sur les technologies web récentes : nécessité de familiariser l’équipe interne de développeurs avec des technologies de développement rapide et avec les méthodes de gestion de projet utilisées par les startups.\n\n## Notre intervention\n\n### Phase 1 : Audit et étude de terrain\n\nNous avons réalisé des entretiens avec les différents collaborateurs-acteurs du processus, au sein des différents pôles intervenant dans les processus. Cela nous a permis d’identifier les actions réalisées par chaque acteur, de prendre en compte les contraintes auxquelles chacun est soumis, de réaliser les mesures et de recueillir les informations indispensables à l’analyse du processus et de ses performances.\n\n### Phase 2 : Analyse\n\nGrâce aux informations récoltées, nous avons pu cartographier le processus, et identifier les activités à fortes valeurs ajoutées, les temps morts et les gaspillages.\n\n### Phase 3 : Reengineering du processus\n\nNous avons repensé et redéfini les processus RH. Cette demarche s’inscrivant dans le plan de transition digitale de la Caisse d’Epargne, nous nous sommes appuyés sur les atouts du digital pour reconcevoir ces processus sous contraintes de coût et de temps.\n\nNous avons alors proposé le développement d’une application RH, plate-forme qui centraliserait toutes les opérations et qui permettrait de simplifier la gestion des activités, donc de limiter les temps morts et inefficacités.\n\nPour développer cette application avec des moyens humains et matériels ultra-limités, nous avons opté pour les technologies innovantes utilisées par les startups. Cette solution impliquait cependant la diversification des compétences de l’équipe de développeurs de la Caisse d’Epargne, ce qui induisait des coûts liés au changement de routines et liés à l’apprentissage de la technologie elle-même.\n\n### Phase 4 : Pair programming et montée en compétences de l’équipe de développeurs\n\nNous avons orienté les choix technologiques de l’équipe vers des solutions qui ont prouvé leur efficacité aussi bien chez les startups que chez certains géants du web : Vue.js pour l’interface graphique, et Lumen (framework léger dérivé de Laravel) pour la couche métier côté serveur.\n\nPour faciliter le démarrage du projet, nous avons partagé notre expertise en fournissant une première base de code, comprenant la structure globale de l’application ainsi que des modules complexes servant d’exemples.\n\nBien entendu, fournir du code ne suffit pas ; ce sont les échanges réguliers réalisés avec les développeurs de l’équipe qui ont permis le transfert de connaissances, la base de code servant de support concret à l’échange et servant d’exemple d’application.\n\n## Résultats\n\nEn un mois, la majorité des fonctionnalités était en place, et une première version de l’application est en cours de finalisation.\n\n![Plateforme RH Caisse d'Epargne](/works/caisse-epargne/note_frais_compressed.png)\n\n_Aperçu de l’interface de déclaration et d’administration des notes de frais conçue et développée en collaboration avec l’équipe de développeurs de la Caisse d’Epargne régionale au sein de laquelle nous sommes intervenus._\n","frontmatter":"title: Optimiser les processus RH à la Caisse d'Epargne\nslug: processus-rh-caisse-epargne\nbanner: /works/caisse-epargne/banner.png\nthumbnail: /works/caisse-epargne/thumbnail.png\nsummary: Le groupe BPCE est le deuxième groupe bancaire en France, né en 2009 de la fusion de l’organe central du réseau des Caisses d’Épargne et de celui des Banques Populaires. Comme les autres acteurs du secteur bancaire, BPCE est actuellement en pleine transition digitale."}},"path":"works/processus-rh-caisse-epargne"}
