{"template":"../src/containers/Work.jsx","sharedHashesByProp":{},"data":{"work":{"attributes":{"title":"Gérer une flotte de runners en temps réel","slug":"real-time-runners","summary":"Simply Charge est une startup qui fournit des batteries mobiles à usage unique. Ces batteries sont mises à disposition dans des distributeurs automatiques, installés chez des commerçants ou dans des lieux publics. Concept prometteur car à la fois pratique pour les personnes tombées en panne de batterie à l’ère des smartphones ultrapuissants, et pour les commerçants qui y voient une source de revenu et de publicité.","banner":"/works/simply-charge/banner.png","thumbnail":"/works/simply-charge/thumbnail.png"},"body":"## Notre client\n\nSimply Charge est une startup qui fournit des batteries mobiles à usage unique. Ces batteries sont mises à disposition dans des distributeurs automatiques, installés chez des commerçants ou dans des lieux publics. Concept prometteur : à la fois pratique pour les personnes tombées en panne de batterie à l’ère des smartphones ultrapuissants et source de revenus complémentaires pour les commerçants.\n\nLe cœur de métier de Simply Charge sera alors l’optimisation du remplissage des distributeurs automatiques de batterie par son équipe de \"runners\".\n\n## La mission qui nous a été confiée\n\nDévelopper une application d’aide à la gestion des stocks permettant :\n\n- Un suivi temps réel du niveau de remplissage des distributeurs\n- Un suivi prédictif pour évaluer à l’avance quels distributeurs auront besoin d’être rechargés\n\n## Notre intervention\n\nNous avons développé une application web JavaScript avec Vulcan.js. Le choix d’utiliser le framework Vulcan a permis :\n\n- De créer une version web et une version mobile Android avec une seule base de code\n- D’accélérer les développements grâce aux fonctionnalités déjà existantes dans Vulcan (mise à jour des données en temps réel, gestion des rôles et des permissions, affichage des données)\n- L’application comporte plusieurs modules interconnectés : gestion des clients, gestion des stocks des distributeurs, et suivi des tournées. Le coursier chargé de remplir les distributeurs utilise l’application pour gérer sa tournée et indique quels distributeurs il a remplis. Un système de QR Code permet un suivi sécurisé du bon déroulement des opérations par l’équipe de Simply Charge.\n\n## Résultats\n\nNous avons développé une solution de gestion complète et opérationnelle en seulement 15 jours. L’application a été mise en production en version web mais aussi mobile.\n\n![Simply Charge](/works/simply-charge/simply-charge.png)\n","frontmatter":"title: Gérer une flotte de runners en temps réel\nslug: real-time-runners\nsummary: Simply Charge est une startup qui fournit des batteries mobiles à usage unique. Ces batteries sont mises à disposition dans des distributeurs automatiques, installés chez des commerçants ou dans des lieux publics. Concept prometteur car à la fois pratique pour les personnes tombées en panne de batterie à l’ère des smartphones ultrapuissants, et pour les commerçants qui y voient une source de revenu et de publicité.\nbanner: /works/simply-charge/banner.png\nthumbnail: /works/simply-charge/thumbnail.png"}},"path":"works/real-time-runners"}
