{"template":"../src/containers/Work.jsx","sharedHashesByProp":{},"data":{"work":{"attributes":{"title":"Développer une application de cartographie de données pour la RGPD","slug":"cartographie-rgpd","summary":"Actinuance est un cabinet de conseil spécialisé en gestion des risques et sécurité des systèmes d’information. L’entreprise accompagne notamment ses clients dans leur mise en conformité avec la Réglementation sur la Protection des Données Personnelles (RGPD) et la gestion des données sur le long terme.","banner":"/works/actinuance/banner.png","thumbnail":"/works/actinuance/thumbnail.jpg"},"body":"## Notre client\n\nActinuance est un cabinet de conseil spécialisé en gestion des risques et sécurité des systèmes d’information. L’entreprise accompagne notamment ses clients dans leur mise en conformité avec la Réglementation sur la Protection des Données Personnelles (RGPD) et la gestion des données sur le long terme.\n\nLa mission qui nous a été confiée\nDévelopper une première version de l’outil permettant la cartographie de l’utilisation des données personnelles au sein des grandes entreprises.\n\nPar exemple, cet outil doit permettre de recenser tous les logiciels qui utilisent la date de naissance des collaborateurs. Il est donc utile pour la mise en conformité avec la RGPD.\n\nA partir d’une maquette conçue par Actinuance, nous avions pour mission de développer une première version de l’application web en mode SaaS.\n\n## Notre intervention\n\n### Phase 1 : Développement d’une première version de l’application web\n\nL’application web a été développée en JavaScript avec Node et React/Redux. Nous avons choisi des frameworks ultra-modernes pour accélérer les développements (Feathers, Rematch), afin d’aboutir au plus vite à une première version commercialisable. L’objectif était en effet de fournir le plus rapidement possible à Actinuance une première version opérationnelle de l’application afin que l’entreprise puisse tester le potentiel de marché.\n\n### Phase 2 : Transfert de connaissances vers l’entreprise\n\nNous avons organisé une session de formation de deux jours afin que l’équipe interne d’ingénieurs et de développeurs puisse réaliser la maintenance de l’application et assumer les développements à venir.\n\n## Résultats\n\nNous avons développé une version opérationnelle de l’outil en 16 jours, ce qui a permis à Actinuance d’immédiatement réaliser des démonstrations grandeur nature de l’outil à ses clients et de le promouvoir.\n\n![Actinuance Mapping](/works/actinuance/actinuance-3.png)\n\nEt parce que nous n’oublions pas que la force des technologies open source repose sur l’intelligence collective de la communauté, nous avons fait un retour d’expérience aux développeurs de la région Montpelliéraine sur le framework Feathers, dans le cadre du Meetup Montpellier JS.\n\n![Meetup Montpellier JS](/works/actinuance/formation-blurred.png)\n\n[Découvrir l'outil IT Maps](https://www.actinuance.com/loutil-it-maps/)\n","frontmatter":"title: Développer une application de cartographie de données pour la RGPD\nslug: cartographie-rgpd\nsummary: Actinuance est un cabinet de conseil spécialisé en gestion des risques et sécurité des systèmes d’information. L’entreprise accompagne notamment ses clients dans leur mise en conformité avec la Réglementation sur la Protection des Données Personnelles (RGPD) et la gestion des données sur le long terme.\nbanner: /works/actinuance/banner.png\nthumbnail: /works/actinuance/thumbnail.jpg"}},"path":"works/cartographie-rgpd"}
